var arr = [
    {
        ed: 5,
        des: 4,
        sot: 2},
    {
        ed: 6,
        des: 4,
        sot: 2}
];




console.log(arr[1].des);

/*
1) Написать функцию, преобразующую число в объект. Передавая на вход число от 0 до 999, мы должны получить на выходе объект, в котором в соответствующих свойствах описаны единицы, десятки и сотни. Например, для числа 245 мы должны получить следующий объект: {‘единицы’: 5, ‘десятки’: 4, ‘сотни’: 2}. Если число превышает 999, необходимо выдать соответствующее сообщение с помощью console.log и вернуть пустой объект.
 */

/*
var object = {
     ed: 5,
    des: 4,
    sot: 2};
 */